erp3l/src/Catalogs/ПоказателиМонитораКлючевыхПоказателей/ПоказателиМонитораКлючевыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиМонитораКлючевыхПоказателей</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПорогЗначимостиТренда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние_ЛевыйДиапазон</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние_ПравыйДиапазон</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрактовкаПоложительногоОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДляРасшифровки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЗначенияТекущегоПериода</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЗначенияПериодаСравнения</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПлановогоЗначения</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Проекция</name>
    <type>
      <types>CatalogRef.Проекции</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеОтклонениеОтПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредельноеОтклонениеОтПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логотип</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмеренияКлючевыхПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьОтображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьОтклоненияВместоАбсолютныхЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПроцентДостиженияЦелиВместоПроцентаОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеродичностьОтображенияДинамики</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаОтображенияДинамики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДиаграммы</name>
    <type>
      <types>EnumRef.ТипыДиаграмм</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНуля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаИтоговогоЗначения</name>
    <type>
      <types>EnumRef.СпособыРасчетаИтоговыхЗначенийПоказателейМКП</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраницаЗначения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраницаЗначения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКоридорЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Расшифровки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/ПоказателиМонитораКлючевыхПоказателей/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	// Корректно проверить настройку диапазонов можно только в том случае, если границы заданы в виде числовых констант.
	Если ТипЗнч(Состояние_ЛевыйДиапазон) = тип("Число") И ТипЗнч(Состояние_ПравыйДиапазон) = Тип("Число") Тогда
		Отказ = ТрактовкаПоложительногоОтклонения = (Состояние_ЛевыйДиапазон >= Состояние_ПравыйДиапазон);
	КонецЕсли;
	
	Если Отказ Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = НСтр("ru = 'Неверно заданы границы для определения состояния'");
		СообщениеПользователю.Сообщить();
		ПроверяемыеРеквизиты.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка.Пустая() Тогда
		ТрактованиеПоложительногоОтклонения = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	Если НЕ ЭтоГруппа Тогда
		СхемаКомпоновкиДляРасшифровки = Новый ХранилищеЗначения(ТиповыеОтчетыУХ.ПолучитьСхемуКомпоновкиДанныхДляРасшифровкиПоказателяМонитора(ЭтотОбъект));
	КонецЕсли;
	
КонецПроцедуры
